000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Акция</name>
    <comment>Признак акционной цены</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипПереоценки</name>
    <type>
      <types>EnumRef.ТипыПереоценок</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <resources>
    <name>ДатаИзменения</name>
    <comment>Внешнее управление: NAV</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Блокирован</name>
    <comment>Внешнее управление: NAV</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеШтрихкода</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDNG</name>
    <comment>IDN группы. Служебный реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEB_АвторепрайсЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_Выгружать</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_МониторингЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <comment>Использовать серийные номера (подарочные сертификаты)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоУКТЗЕД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маржинальность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТовара</name>
    <type>
      <types>EnumRef.НазначенияТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Новинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовинкаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьЦенниковБезПиктограмм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>EnumRef.ТипыСерийныхНомеровСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрокаДействия</name>
    <type>
      <types>EnumRef.СрокДействияПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОбычныйЦенник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксклюзив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кешбек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзОбменаNavision</name>
    <comment>//A++ расширение функционала запрета обмена с Navision</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <comment>Хеш объекта полученного из Navison</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСписыватьБонусы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЦена</name>
    <comment>Текущая учетная цена (себестоимость) из Navision</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.ВидыНоменклатуры</owners>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ОбменДаннымиКСОСервер/Module.bsl
Процедура КСОСправочникиРегистрацияИзмененийПриЗаписи(Источник, Отказ) Экспорт
	УзлыОбмена = ПланыОбмена.ОбменКСО.Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка = ПланыОбмена.ОбменКСО.ЭтотУзел() Тогда
			Продолжить;
		КонецЕсли;
		Если УзлыОбмена.Ссылка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.Номенклатура") 
			ИЛИ ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура")  
				Тогда
			ИсточникДанных = Источник.Ссылка;
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.Номенклатура") 
			ИЛИ ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура")  
				Тогда
			ИсточникДанных = Источник.Ссылка;
		Иначе
			ИсточникДанных = Источник;
		КонецЕсли;
		ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка,ИсточникДанных.Ссылка);
	КонецЦикла;
	
КонецПроцедуры


Процедура КСОРегистрыРегистрацияИзмененийПриЗаписи(Источник, Отказ, Замещение) Экспорт
	УзлыОбмена = ПланыОбмена.ОбменКСО.Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка = ПланыОбмена.ОбменКСО.ЭтотУзел() Тогда
			Продолжить;
		КонецЕсли;
		Если УзлыОбмена.Ссылка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Строка_ Из Источник Цикл
			Если УзлыОбмена.ВидЦенКСО <> Строка_.ВидЦены Тогда
				Продолжить;
			КонецЕсли;
			
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка,Строка_.Номенклатура);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


Функция ПолучитьУзелОбменаКСО() Экспорт
	Возврат ПланыОбмена.ОбменКСО.НайтиПоКоду("КСО");	
КонецФункции


Функция ЗапуститьОбменДаннымиКСО() Экспорт
	УзелОбмена = ПолучитьУзелОбменаКСО();
	Параметры = Новый Структура();
	Параметры.Вставить("УзелОбмена",УзелОбмена);
	Параметры.Вставить("АдресСервера",УзелОбмена.АдресСервера);
	Параметры.Вставить("АдресРесурса",УзелОбмена.АдресРесурса);
	Параметры.Вставить("Порт",УзелОбмена.Порт);
	Параметры.Вставить("ВидЦены",УзелОбмена.ВидЦенКСО);
	Параметры.Вставить("РезультатОбмена",Новый Массив);
	Параметры.Вставить("ВыгружатьКартинки", Ложь);

	
	ВыгрузкаНоменклатурыГрупповой(Параметры);
	
	Возврат Параметры;
КонецФункции




&НаСервере
Функция СтруктуруВТекстДЖСОН(СтруктураПараметров) Экспорт
	
	ЗаписьДЖСОН = Новый ЗаписьJSON;
	ЗаписьДЖСОН.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьДЖСОН,СтруктураПараметров);
	ТекстДЖСОН = ЗаписьДЖСОН.Закрыть();
	
	Возврат ТекстДЖСОН;
КонецФункции

//2023-01-05 sa преобразование текста JSON в структуру 
Функция ТекстДЖСОНвСтруктуру(ТекстДЖСОН) Экспорт
	СтруктураОтвета = Новый Структура;
	Если ТекстДЖСОН = "" Тогда
		СтруктураОтвета.Вставить("Success",Ложь);
		СтруктураОтвета.Вставить("Description","Текст не в формате JSON (пустой)!");
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	ФайлJSON = Новый ЧтениеJSON;
	ФайлJSON.УстановитьСтроку(ТекстДЖСОН);
	
	Попытка
		СтруктураОтвета = ПрочитатьJSON(ФайлJSON);
		ФайлJSON.Закрыть();
	Исключение
		СтруктураОтвета.Вставить("Success",Ложь);
		СтруктураОтвета.Вставить("Description","Текст не в формате JSON!"+Символы.ПС+ТекстДЖСОН);
	КонецПопытки;
	
	Возврат СтруктураОтвета;
КонецФункции

Функция ПолучитьЗарегистрированныеИзменения()
	//ограничим запрос 1000 записей т.к. иначе оно тупо не успеет выгрузится за промежуток между регламентными заданиями.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1000
	               |	НоменклатураИзменения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
	               |ГДЕ
	               |	НоменклатураИзменения.Узел = &Узел";
	
	Запрос.УстановитьПараметр("Узел", ПолучитьУзелОбменаКСО());
	Товары = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат Товары;
	
КонецФункции

Функция СформироватьСтруктуруТовара(Параметры, Товар)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СпрНоменклатура.Ссылка КАК Ссылка,
	               |	СпрНоменклатура.Код КАК id,
	               |	СпрНоменклатура.Код КАК sku,
	               |	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.ВидНоменклатуры) КАК ВидНоменклатуры,
	               |	СпрНоменклатура.ЕдиницаИзмерения.Наименование КАК unit,
	               |	СпрНоменклатура.Наименование КАК name,
	               |	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.СтавкаНДС) КАК taxRate,
	               |	ЦеныНоменклатурыСрезПоследних.Цена * 100 КАК price,
	               |	ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование КАК priceLevel
	               |ИЗ
	               |	Справочник.Номенклатура КАК СпрНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |				,
	               |				ВидЦены = &ВидЦены
	               |					И Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО СпрНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |ГДЕ
	               |	СпрНоменклатура.Ссылка = &Номенклатура
	               |	И СпрНоменклатура.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Штрихкоды.Штрихкод КАК barcode,
	               |	ЕСТЬNULL(Штрихкоды.Упаковка.Наименование, Штрихкоды.Владелец.ЕдиницаИзмерения.Наименование) КАК unit
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Владелец = &Номенклатура
	               //|	И Штрихкоды.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.EAN13)
				   |";
	Запрос.УстановитьПараметр("Номенклатура",Товар);
	Запрос.УстановитьПараметр("ВидЦены",Параметры.ВидЦены);
	ПакетЗапросов = Запрос.ВыполнитьПакет();

	РезТовары = ПакетЗапросов[0].Выбрать();
	Пока РезТовары.Следующий() Цикл
		СтруктураТовара = Новый Структура("id, sku, taxRate, name, unit, price, priceLevel, barcodes","","","","","",0,"",""); 
		ЗаполнитьЗначенияСвойств(СтруктураТовара,РезТовары);
		СтруктураТовара.Вставить("id", Строка(РезТовары.Ссылка.УникальныйИдентификатор()));
		Если Параметры.ВыгружатьКартинки Тогда
			МассивТоваровДляКартинок = Новый Массив;
			МассивТоваровДляКартинок.Добавить(РезТовары.Ссылка);
			Картинки_ = ЗаказыПокупателейСервер.ПолучитьСоответствиеКартинокТовара(МассивТоваровДляКартинок,Истина);
			ДанныеКартинки = Картинки_.Получить(РезТовары.Ссылка);
			Если ЗначениеЗаполнено(ДанныеКартинки) Тогда          
				СтруктураТовара.Вставить("Картинка",ДанныеКартинки);	
			КонецЕсли;
		КонецЕсли;
		
		МассивШК = Новый Массив;
		РезШК = ПакетЗапросов[1].Выбрать();
		Пока РезШК.Следующий() Цикл
			СтруктураШК = Новый Структура("barcode, unit","","");
			ЗаполнитьЗначенияСвойств(СтруктураШК,РезШК);			
			МассивШК.Добавить(СтруктураШК);	
		КонецЦикла;
		СтруктураТовара.Вставить("barcodes",МассивШК); 
	КонецЦикла;

	Возврат СтруктураТовара;	
КонецФункции

Функция ВыгрузкаНоменклатурыГрупповой(Параметры) Экспорт
	ТекстОтвета = "";
    Параметры.Вставить("РезультатОбмена",Новый Массив);
	
	МассивСообщений = Новый Массив;
	НачВремя = ТекущаяДата();
	Параметры.РезультатОбмена.Добавить("Начало выгрузки: " + НачВремя);
	
	ЛимитПакета = 10 * 1024 * 1024; // 10 МБ
	ТекущийРазмер = 0;
	
	Если Не Параметры.Свойство("Товары") Тогда 
		Товары = ПолучитьЗарегистрированныеИзменения(); 
		Параметры.Вставить("Товары",Товары);
	КонецЕсли;
	
	
	// буферы текущего пакета
	МассивТоваров = Новый Массив;
	СоответствиеКартинок = Новый Соответствие;
	// =========================================
	// ОСНОВНОЙ ЦИКЛ
	// =========================================
	Для Каждого Товар Из Параметры.Товары Цикл
		
		СтруктураТовара = СформироватьСтруктуруТовара(Параметры,Товар);
		
		Если Не ЗначениеЗаполнено(СтруктураТовара.priceLevel) Тогда
			Параметры.РезультатОбмена.Добавить(""+СтруктураТовара.sku+" "+СтруктураТовара.name+" не имеет установленной цены");
			Продолжить;
		КонецЕсли;
		
		Если СтруктураТовара.Свойство("Картинка") Тогда
			ДанныеКартинки = СтруктураТовара.Картинка;
			КартинкаРазмер = ДанныеКартинки.Размер();
		Иначе 
		//	ДанныеКартинки = БиблиотекаКартинок.Документ.ПолучитьДвоичныеДанные();
			ДанныеКартинки = Неопределено; 
			КартинкаРазмер = 0;
		КонецЕсли;

		Ключ = СтруктураТовара.id;

		// если не влазит в пакет → отправляем текущий
		Если ТекущийРазмер + КартинкаРазмер > ЛимитПакета Тогда
			
			ОтправитьПакет(Параметры, МассивТоваров,СоответствиеКартинок);

			// очистка
			МассивТоваров = Новый Массив;
			СоответствиеКартинок = Новый Соответствие;
			ТекущийРазмер = 0;

		КонецЕсли;
		//Если ФормироватьЛогФайл Тогда
		//	Сообщить("SKU: " + СтруктураТовара.SKU + " = " + ОКР(КартинкаРазмер/1024) + "К");
		//КонецЕсли;
		
		СтруктураТовара.Удалить("Картинка");
		МассивТоваров.Добавить(СтруктураТовара);
		Если КартинкаРазмер > 0 Тогда
			СоответствиеКартинок.Вставить(Ключ, ДанныеКартинки);
		КонецЕсли;
		
		//один товар без картинок занимает примерно 512 байт. Это нужно учесть при подсчете размера.
		ТекущийРазмер = ТекущийРазмер +512+ КартинкаРазмер;
		
	КонецЦикла;

	// отправка последнего пакета
	ОтправитьПакет(Параметры, МассивТоваров,СоответствиеКартинок);

	КонВремя = ТекущаяДата();
	МассивСообщений.Добавить("Окончание выгрузки: " + КонВремя);
	Длительность = ?(КонВремя=НачВремя, 1, (КонВремя-НачВремя));
	Параметры.РезультатОбмена.Добавить("Длительность: " + Длительность 
		+ " с. Товаров/сек = " 
		+ (Параметры.Товары.Количество()/Длительность));
		
   
КонецФункции

// =========================================
// ПРОЦЕДУРА ОТПРАВКИ ПАКЕТА
// =========================================
Процедура ОтправитьПакет(Параметры, МассивТоваров, СоответствиеКартинок)
 	ХТТПСоединение = Новый HTTPСоединение(Параметры.АдресСервера, Параметры.Порт);


	Если МассивТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
    ТекстОтвета = "";
	
	Граница = "----1CFormBoundary" + Строка(Новый УникальныйИдентификатор());

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Граница);

	ХТТПЗапрос = Новый HTTPЗапрос(Параметры.АдресРесурса, Заголовки);

	// JSON
	СтруктураВыгрузки = Новый Структура("products", МассивТоваров);
	Попытка
		ТекстЗапроса = СтруктуруВТекстДЖСОН(СтруктураВыгрузки);
	Исключение
		ОтветСервиса = "";
		Параметры.РезультатОбмена.Добавить("Ошибка при формировании пакета: "+ОписаниеОшибки());
		//ОтобразитьСтруктуруРекурсивно("",СтруктураВыгрузки);
		//Сообщить("");
		Возврат;
	КонецПопытки;
	
	Поток = Новый ПотокВПамяти();
	Запись = Новый ЗаписьДанных(Поток, КодировкаТекста.UTF8);

	// --- JSON part ---
	Запись.ЗаписатьСтроку("--" + Граница, КодировкаТекста.UTF8);
	Запись.ЗаписатьСтроку("Content-Disposition: form-data; name=""product""", КодировкаТекста.UTF8);
	Запись.ЗаписатьСтроку("Content-Type: application/json; charset=UTF-8", КодировкаТекста.UTF8);
	Запись.ЗаписатьСтроку("");
	Запись.ЗаписатьСтроку(ТекстЗапроса, КодировкаТекста.UTF8);
	
	ТекущийРазмер = 0;
	// --- IMAGE parts ---
	Для Каждого КлючИЗначение Из СоответствиеКартинок Цикл
		
		ДанныеКартинки = СоответствиеКартинок.Получить(КлючИЗначение.Ключ);
		
		ТекущийРазмер = ТекущийРазмер + ДанныеКартинки.Размер();
		
		Запись.ЗаписатьСтроку("--" + Граница, КодировкаТекста.UTF8);
		Запись.ЗаписатьСтроку(
			"Content-Disposition: form-data; name=""images[" + КлючИЗначение.Ключ + "]""; filename=""" + КлючИЗначение.Ключ + ".jpg""",
			КодировкаТекста.UTF8
		);
		Запись.ЗаписатьСтроку("Content-Type: image/jpeg", КодировкаТекста.UTF8);
		Запись.ЗаписатьСтроку("");

		Запись.Записать(ДанныеКартинки);
		Запись.ЗаписатьСтроку("");

	КонецЦикла;

	// закрытие
	Запись.ЗаписатьСтроку("--" + Граница + "--", КодировкаТекста.UTF8);
	Запись.Закрыть();

	ТелоЗапроса = Поток.ЗакрытьИПолучитьДвоичныеДанные();

	// (опционально дамп)
	//Если ФормироватьЛогФайл Тогда
	//	ТелоЗапроса.Записать(КаталогЛогФайлов+"\dump_"+Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd_ЧЧммсс_")+Строка(Новый УникальныйИдентификатор())+".txt"); 
	//КонецЕсли;
	
	ХТТПЗапрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);

	Сообщить("Отправка пакета: " + МассивТоваров.Количество() 
		+ " товаров, ~" + ОКР(ТекущийРазмер/1024/1024,2) + " МБ");

	ОтветСервиса = ХТТПСоединение.ОтправитьДляОбработки(ХТТПЗапрос);

	Если ОтветСервиса.КодСостояния = 200 Тогда
		
		ТекстОтвета = ТекстОтвета + ОтветСервиса.ПолучитьТелоКакСтроку()+Символы.ПС;

		Если ЗначениеЗаполнено(ТекстОтвета) Тогда
			
			СтруктураОтвета = ТекстДЖСОНвСтруктуру(ТекстОтвета);

			Для Каждого ОтветПоТовару Из СтруктураОтвета.response Цикл
				
				Если ОтветПоТовару.success Тогда                                                
					Попытка
						Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОтветПоТовару.id));
						Если Найти(Строка(Номенклатура),"<Обмен не найден>")>0 Тогда
							Параметры.РезультатОбмена.Добавить("В базе 1С не найден успешно загруженный товар с УИД "+ОтветПоТовару.id);
							Продолжить;
						КонецЕсли;
						ПланыОбмена.УдалитьРегистрациюИзменений(Параметры.УзелОбмена, Номенклатура);
					Исключение
						Параметры.РезультатОбмена.Добавить("Исключительная ситуация при поиске товара с УИД "+ОтветПоТовару.id);
					КонецПопытки;
				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	Иначе
		Параметры.РезультатОбмена.Добавить("Ошибка при передаче пакета: " + ОтветСервиса.КодСостояния 
			+ Символы.ПС + ОтветСервиса.ПолучитьТелоКакСтроку());
	КонецЕсли;

КонецПроцедуры
